saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/MindMotion.MM32L0xx_DFP.1.0.6.pdsc
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
	  <device Dname="MM32L051PT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L051PT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
      <device Dname="MM32L051NT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L051NT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
	  <device Dname="MM32L051TW">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L051TW"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x8000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_32.FLM"   start="0x08000000"  size="0x8000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

   	  </device>
 
	  </subFamily>	
	  <!-- ************************  Subfamily 'MM32L06x'  **************************** -->	
	    <subFamily DsubFamily="MM32L06x">
        <processor Dclock="48000000"/>
       
      <!-- *************************  Device 'MM32L06x'  ***************************** -->	  

	  
	  <device Dname="MM32L061PF">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L061PF"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
	  <device Dname="MM32L061PT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L061PT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
      <device Dname="MM32L061NT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L061NT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x1/PB_MM32L051.pdf"                   title="MM32L0x1 Product Brief"/>
		<book    name="Documents/MM32L0x1/DS_MM32L0x1.pdf"                   title="MM32L0x1 Datasheet"/>

      </device>
	  <device Dname="MM32L061TW">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L061TW"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_64.FLM"   start="0x08000000"  size="0x10000"                  default="1"/>
        
        
