saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/MindMotion.MM32L0xx_DFP.1.0.6.pdsc
      <device Dname="MM32L072TW">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L072TW"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x2/PB_MM32L072.pdf"                   title="MM32L0x2 Product Brief"/>
		<book    name="Documents/MM32L0x2/DS_MM32L0x2.pdf"                   title="MM32L0x2 Datasheet"/>

      </device>		  
	  <device Dname="MM32L073NT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L073NT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x3/PB_MM32L073.pdf"                   title="MM32L0x3 Product Brief"/>
		<book    name="Documents/MM32L0x3/DS_MM32L0x3.pdf"                   title="MM32L0x3 Datasheet"/>

      </device>		  
      <device Dname="MM32L073PT">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L073PT"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x3/PB_MM32L073.pdf"                   title="MM32L0x3 Product Brief"/>
		<book    name="Documents/MM32L0x3/DS_MM32L0x3.pdf"                   title="MM32L0x3 Datasheet"/>

      </device>		  
      <device Dname="MM32L073PF">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
        <compile header="Device/MM32L0xx/Include/HAL_device.h"  define="MM32L073PF"/>
        <debug      svd="SVD/MM32L0xx.svd"/>
        <memory     id="IROM1"                      start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MM32L0xx_128.FLM"   start="0x08000000"  size="0x20000"                  default="1"/>
        
        
        <book    name="Documents/MM32L0x3/PB_MM32L073.pdf"                   title="MM32L0x3 Product Brief"/>
		<book    name="Documents/MM32L0x3/DS_MM32L0x3.pdf"                   title="MM32L0x3 Datasheet"/>

      </device>		  
      </subFamily>  
    </family>

	</devices>



  
  
  
  <conditions>   <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
	
	<!-- add 20160418 start -->
    <condition id="Cortex-M Device">
      <description>Cortex-M processor based device: one of CM0, CM0+, CM3, CM4, CM7, SC000, SC3000</description>
      <accept Dcore="Cortex-M0"/>
    </condition>

  <condition id="ARMCC Cortex-M">
      <description>ARMCC and Cortex-M</description>
      <require Tcompiler="ARMCC"/>
      <require condition="Cortex-M Device"/>
    </condition>
	
    <condition id="Cortex-M Device CMSIS Core">
      <description>ARM Cortex-M device that depends on CMSIS Core component</description>
      <require condition="Cortex-M Device"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="Cortex-M Device Startup">
      <description>Only show for Cortex-M based devices. Depends on Device Startup component.</description>
      <require condition="Cortex-M Device"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    
    <condition id="CMSIS Core">
      <description>CMSIS CORE processor and device specific Startup files</description>
        <require Cclass="CMSIS" Cgroup="CORE"/>
		<require Dvendor="MindMotion:132" Dname="MM32L0*"/> 
	</condition>
  </conditions>
  
  
  <components>
    <!-- CMSIS-Core component not required, is coming from CMSIS Pack -->
  
    <!-- Startup MM32L0xx -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.4" condition="CMSIS Core">
      <description>System Startup for MindMotion MM32L0xx Series devices</description>
      <files>
        <file category="header"  name="Device/MM32L0xx/Include/HAL_device.h"/>
		<file category="header"  name="Device/MM32L0xx/Source/system_MM32L0xx.h"/>
		<file category="sourceC" name="Device/MM32L0xx/Source/system_MM32L0xx.c" attr="config"  version="1.0.4"/> 
        <file category="sourceAsm" name="Device/MM32L0xx/Source/KEIL_StartAsm/startup_MM32L0xx.s" attr="config" version="1.0.4" condition="Compiler ARMCC"/>
        
      </files>
    </component> 
  


 

  </components>
  

  <examples>
    <!-- MM32_MBL0xxPF_Board Core Board -->

	<example name="MM32_MBL0xxPF_Board GPIO LED blinky" doc="README.TXT" folder="Boards/MBL0xxPF_Boardreg/RegSample/GPIO_LED">
		<description>MM32_MBL0xxPF_Board Blinky example</description>             
		<board name="MM32_MBL0xxPF_Board" vendor="MindMotion"/>
		<project>   
			<environment name="uv" load="KEILPRJ/BLINK.uvprojx"/>
		</project>
		<attributes>
			<component Cclass="CMSIS"     Cgroup="CORE"/>
			<component Cclass="Device"    Cgroup="Startup"/>
			<category>Getting Started</category>
		</attributes>
	</example>
	
