saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/MindMotion.MM32L0xx_DFP.1.0.6.pdsc
  </examples>
  
  
  <boards>
    <board vendor="MindMotion" name="MM32_MBL0xxPF_Board" revision="Ver 1.0" >
      <description>MindMotion MM32_MBL0xxPF_Board Development Board</description>
      <image small="Images/MiniBoard_small.jpg" large="Images/MiniBoard_big.jpg"/>
      <book category="schematic" name="Documents/boards/MM32_MiniBoard_Schematic_Ver1_1.pdf" title="MM32_MBL0xxPF_Board Schematics"/>
	  <book category="manual" name="Documents/boards/PB_MM32_MiniBoard_Ver1_1.pdf" title="MM32_MBL0xxPF_Board Product Brief"/>
	  <book category="setup" name="Documents/boards/QS_MiniBoard_Quick_Start_Guide_Ver1_2.pdf" title="MM32_MBL0xxPF_Board Quick Start Guide"/>
	  <book category="manual" name="Documents/boards/UM_MM32_MiniBoard_Ver1_1.pdf" title="MM32_MBL0xxPF_Board UserManual"/>
      <mountedDevice    deviceIndex="0" Dvendor="MindMotion:132" Dname="MM32L073PF"/>
	  <compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32L07x"/>	  
	  <compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32L06x"/>
	  <compatibleDevice deviceIndex="0" Dvendor="MindMotion:132" DsubFamily="MM32L05x"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="Button"    n="1"              name="Push-buttons: Reset"/>
      <feature type="LED"       n="2"              name="LEDs: Power, One user"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>

    </board>
  </boards>
  
  
</package>
